#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.cloudwatch_lambda.data.archive_file.cwl2eslambda: Refreshing state...
module.hello_world_service.data.aws_caller_identity.current: Refreshing state...
module.cloudwatch_lambda.data.aws_iam_policy_document.lambda_assume_policy: Refreshing state...
module.bastion.module.bastion.data.aws_iam_policy_document.default: Refreshing state...
module.hello_world_service.module.ecs_service.data.aws_iam_policy_document.ecs_assume_role_policy: Refreshing state...
module.prowler.module.ecs_task_definition.data.aws_iam_policy_document.task_permissions: Refreshing state...
module.cloudtrail.data.aws_caller_identity.current: Refreshing state...
module.es_cluster.data.aws_caller_identity.current: Refreshing state...
module.cloudtrail.data.aws_iam_policy_document.cloudtrail_assume_policy: Refreshing state...
module.es_cluster.data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Refreshing state...
module.cloudtrail.data.aws_region.current: Refreshing state...
module.prowler.data.aws_iam_policy_document.ecs_assume_policy: Refreshing state...
module.prowler.data.aws_region.current: Refreshing state...
module.hello_world_service.data.aws_region.current: Refreshing state...
module.prowler.module.ecs_task_definition.data.aws_iam_policy_document.assume_role_policy: Refreshing state...
module.prowler.module.ecs_task_definition.data.aws_region.current: Refreshing state...
module.hello_world_service.module.ecs_service.data.aws_region.current: Refreshing state...
module.es_cluster.data.aws_region.current: Refreshing state...
module.es_cluster.data.aws_iam_policy_document.this: Refreshing state...
module.hello_world_service.data.aws_iam_policy_document.cloudwatch_logs_allow_kms: Refreshing state...
module.network.data.aws_availability_zones.all: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion.aws_security_group.bastion_ssh will be created
  + resource "aws_security_group" "bastion_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH to VPC"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.cloudtrail.aws_cloudtrail.trail will be created
  + resource "aws_cloudtrail" "trail" {
      + arn                           = (known after apply)
      + cloud_watch_logs_group_arn    = (known after apply)
      + cloud_watch_logs_role_arn     = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = false
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "fishtech-trail-prod"
      + s3_bucket_name                = (known after apply)
    }

  # module.cloudtrail.aws_cloudwatch_log_group.cloudtrail will be created
  + resource "aws_cloudwatch_log_group" "cloudtrail" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/cloudtrail-prod"
      + retention_in_days = 3
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.cloudtrail.aws_cloudwatch_log_subscription_filter.cloudtrail_cloudwatch_logs_to_es will be created
  + resource "aws_cloudwatch_log_subscription_filter" "cloudtrail_cloudwatch_logs_to_es" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/cloudtrail-prod"
      + name            = "cloudwatch_logs_to_elasticsearch"
      + role_arn        = (known after apply)
    }

  # module.cloudtrail.aws_iam_role.cloudtrail_elasticsearch_execution_role will be created
  + resource "aws_iam_role" "cloudtrail_elasticsearch_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloudtrail_elasticsearch_execution_role-prod"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.cloudtrail.aws_iam_role_policy.cloudtrail_logs will be created
  + resource "aws_iam_role_policy" "cloudtrail_logs" {
      + id     = (known after apply)
      + name   = "cloudtrail_logs_execution_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.cloudtrail.aws_lambda_permission.cloudtrail_cloudwatch_allow will be created
  + resource "aws_lambda_permission" "cloudtrail_cloudwatch_allow" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "logs.us-east-1.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "cloudtrail_cloudwatch_allow"
    }

  # module.cloudtrail.aws_s3_bucket.log_bucket will be created
  + resource "aws_s3_bucket" "log_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mitchell-fishtech-cloudtrail-logs-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::mitchell-fishtech-cloudtrail-logs-prod"
                      + Sid       = "AWSCloudTrailAclCheck"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::mitchell-fishtech-cloudtrail-logs-prod/AWSLogs/116722176476/*"
                      + Sid       = "AWSCloudTrailWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.cloudwatch_lambda.aws_iam_role.lambda_elasticsearch_execution_role will be created
  + resource "aws_iam_role" "lambda_elasticsearch_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_elasticsearch_execution_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.cloudwatch_lambda.aws_iam_role_policy.lambda_elasticsearch_execution_policy will be created
  + resource "aws_iam_role_policy" "lambda_elasticsearch_execution_policy" {
      + id     = (known after apply)
      + name   = "lambda_elasticsearch_execution_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                  + {
                      + Action   = "es:ESHttpPost"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.cloudwatch_lambda.aws_lambda_function.cwl_stream_lambda will be created
  + resource "aws_lambda_function" "cwl_stream_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../../cloudwatch-logs/cwl2eslambda.zip"
      + function_name                  = "LogsToElasticsearch-prod"
      + handler                        = "cwl2es.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs10.x"
      + source_code_hash               = "9ri0LJRHXj/z+2VStt0qXKVTbyCZuxw/Qdsq89GegTg="
      + source_code_size               = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "fishtech-prod"
      + tags = {
          + "app" = "fishtech"
          + "env" = "prod"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_app_logs will be created
  + resource "aws_cloudwatch_log_group" "es_app_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/es/app-logs-prod"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_index_logs will be created
  + resource "aws_cloudwatch_log_group" "es_index_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/es/index-logs-prod"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "es_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/es/slow-logs-prod"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy will be created
  + resource "aws_cloudwatch_log_resource_policy" "elasticsearch-log-publishing-policy" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:PutLogEventsBatch",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                      + Resource  = "arn:aws:logs:*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "elasticsearch-log-publishing-policy"
    }

  # module.es_cluster.aws_elasticsearch_domain.es will be created
  + resource "aws_elasticsearch_domain" "es" {
      + access_policies       = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:es:us-east-1:116722176476:domain/prod/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + advanced_options      = (known after apply)
      + arn                   = (known after apply)
      + domain_id             = (known after apply)
      + domain_name           = "prod"
      + elasticsearch_version = "6.8"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + kibana_endpoint       = (known after apply)
      + tags                  = {
          + "app" = "fishtech"
          + "env" = "prod"
        }

      + advanced_security_options {
          + enabled                        = (known after apply)
          + internal_user_database_enabled = (known after apply)

          + master_user_options {
              + master_user_arn      = (known after apply)
              + master_user_name     = (known after apply)
              + master_user_password = (sensitive value)
            }
        }

      + cluster_config {
          + dedicated_master_count   = 3
          + dedicated_master_enabled = true
          + dedicated_master_type    = "t3.small.elasticsearch"
          + instance_count           = 2
          + instance_type            = "t3.small.elasticsearch"
          + zone_awareness_enabled   = true

          + zone_awareness_config {
              + availability_zone_count = 2
            }
        }

      + domain_endpoint_options {
          + enforce_https       = true
          + tls_security_policy = "Policy-Min-TLS-1-2-2019-07"
        }

      + ebs_options {
          + ebs_enabled = true
          + volume_size = 10
          + volume_type = (known after apply)
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "ES_APPLICATION_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "INDEX_SLOW_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "SEARCH_SLOW_LOGS"
        }

      + node_to_node_encryption {
          + enabled = true
        }

      + vpc_options {
          + availability_zones = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.es_cluster.aws_iam_service_linked_role.es will be created
  + resource "aws_iam_service_linked_role" "es" {
      + arn              = (known after apply)
      + aws_service_name = "es.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + unique_id        = (known after apply)
    }

  # module.es_cluster.aws_security_group.elasticsearch will be created
  + resource "aws_security_group" "elasticsearch" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "allow_tls"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.hello_world_service.aws_cloudwatch_log_subscription_filter.cloudwatch_logs_to_es will be created
  + resource "aws_cloudwatch_log_subscription_filter" "cloudwatch_logs_to_es" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/ecs/prod/fishtech"
      + name            = "cloudwatch_logs_to_elasticsearch"
      + role_arn        = (known after apply)
    }

  # module.hello_world_service.aws_kms_key.cluster_kms will be created
  + resource "aws_kms_key" "cluster_kms" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "Key for ECS log encryption"
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::116722176476:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow logs KMS access"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.hello_world_service.aws_lambda_permission.ecs_service_cloudwatch_allow will be created
  + resource "aws_lambda_permission" "ecs_service_cloudwatch_allow" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "logs.us-east-1.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "cloudwatch_allow"
    }

  # module.hello_world_service.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "fishtech-prod"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # module.hello_world_service.aws_lb_listener.http[0] will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.hello_world_service.aws_lb_listener.http[1] will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8081
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.hello_world_service.aws_lb_target_group.http[0] will be created
  + resource "aws_lb_target_group" "http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 90
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "fishtech-prod-8080"
      + port                               = 8080
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.hello_world_service.aws_lb_target_group.http[1] will be created
  + resource "aws_lb_target_group" "http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 90
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "fishtech-prod-8081"
      + port                               = 8081
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.hello_world_service.aws_security_group.lb_sg will be created
  + resource "aws_security_group" "lb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lb-fishtech-prod"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.hello_world_service.aws_security_group_rule.app_lb_allow_all_http[0] will be created
  + resource "aws_security_group_rule" "app_lb_allow_all_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.hello_world_service.aws_security_group_rule.app_lb_allow_all_http[1] will be created
  + resource "aws_security_group_rule" "app_lb_allow_all_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8081
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8081
      + type                     = "ingress"
    }

  # module.hello_world_service.aws_security_group_rule.app_lb_allow_outbound will be created
  + resource "aws_security_group_rule" "app_lb_allow_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.data.aws_availability_zones.all will be read during apply
  # (config refers to values not yet known)
 <= data "aws_availability_zones" "all"  {
        group_names = [
            "us-east-1",
        ]
      ~ id          = "2020-10-04 20:09:57.676334326 +0000 UTC" -> "2020-10-04 20:09:59.975264159 +0000 UTC"
        names       = [
            "us-east-1a",
            "us-east-1b",
            "us-east-1c",
            "us-east-1d",
            "us-east-1e",
            "us-east-1f",
        ]
        zone_ids    = [
            "use1-az6",
            "use1-az1",
            "use1-az2",
            "use1-az4",
            "use1-az3",
            "use1-az5",
        ]
    }

  # module.prowler.aws_cloudwatch_log_group.prowler will be created
  + resource "aws_cloudwatch_log_group" "prowler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/fishtech/prowler/prod"
      + retention_in_days = 3
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.prowler.aws_cloudwatch_log_subscription_filter.prowler_cloudwatch_logs_to_es will be created
  + resource "aws_cloudwatch_log_subscription_filter" "prowler_cloudwatch_logs_to_es" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = "/ecs/fishtech/prowler/prod"
      + name            = "cloudwatch_logs_to_elasticsearch"
      + role_arn        = (known after apply)
    }

  # module.prowler.aws_iam_role.prowler_role will be created
  + resource "aws_iam_role" "prowler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prowler-ecs-prod"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.prowler.aws_iam_role_policy.prowler_logs will be created
  + resource "aws_iam_role_policy" "prowler_logs" {
      + id     = (known after apply)
      + name   = "prowler_logs_execution_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.prowler.aws_iam_role_policy_attachment.read_only will be created
  + resource "aws_iam_role_policy_attachment" "read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/job-function/ViewOnlyAccess"
      + role       = "prowler-task-role"
    }

  # module.prowler.aws_iam_role_policy_attachment.security_audit will be created
  + resource "aws_iam_role_policy_attachment" "security_audit" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecurityAudit"
      + role       = "prowler-task-role"
    }

  # module.prowler.aws_lambda_permission.prowler_cloudwatch_allow will be created
  + resource "aws_lambda_permission" "prowler_cloudwatch_allow" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "logs.us-east-1.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "prowler_cloudwatch_allow"
    }

  # module.bastion.module.bastion.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data"  {
      + id       = "f921641c31ef1415e3f569c38b328fe58bb595a28d20c08d3d9eb39e63b22c20"
      + rendered = <<~EOT
            #!/usr/bin/env bash
            
            apt-get update
            apt-get -y install figlet jq make
            
            # Generate system banner
            figlet "prod" > /etc/motd
            
            # Setup DNS Search domains
            echo 'search ' > '/etc/resolvconf/resolv.conf.d/base'
            resolvconf -u
            
            # Setup local vanity hostname
            echo 'fishtech-bastion.' | sed 's/\.$//' > /etc/hostname
            hostname `cat /etc/hostname`
            
            ##
            ## Setup SSH Config
            ##
            cat <<"__EOF__" > /home/ec2-user/.ssh/config
            Host *
                StrictHostKeyChecking no
            __EOF__
            chmod 600 /home/ec2-user/.ssh/config
            chown ec2-user:ec2-user /home/ec2-user/.ssh/config
            
            # Setup default `make` support
            echo 'alias make="make -C /usr/local/include --no-print-directory"' >> /etc/skel/.bash_aliases
            cp /etc/skel/.bash_aliases /root/.bash_aliases
            cp /etc/skel/.bash_aliases /home/ec2-user/.bash_aliases
            
            echo 'default:: help' > /usr/local/include/Makefile
            echo '-include Makefile.*' >> /usr/local/include/Makefile
            
            ##
            ## Makefile help
            ##
            cat <<"__EOF__" > /usr/local/include/Makefile.help
            
            # Ensures that a variable is defined
            define assert-set
              @[ -n "$($1)" ] || (echo "$(1) not defined in $(@)"; exit 1)
            endef
            
            default:: help
            
            .PHONY : help
            ## This help screen
            help:
            	@printf "Available targets:\n\n"
            	@awk '/^[a-zA-Z\-\_0-9%:\\]+:/ { \
            			helpMessage = match(lastLine, /^## (.*)/); \
            			if (helpMessage) { \
            					helpCommand = $$$1; \
            					helpMessage = substr(lastLine, RSTART + 3, RLENGTH); \
            						gsub("\\\\", "", helpCommand); \
            						gsub(":+$$$", "", helpCommand); \
            					printf "  \x1b[32;01m%-35s\x1b[0m %s\n", helpCommand, helpMessage; \
            			} \
            	} \
            	{ lastLine = $$$0 }' $(MAKEFILE_LIST) | sort -u
            	@printf "\n"
            
            __EOF__
            chmod 644 /usr/local/include/Makefile.help
            
        EOT
      + template = <<~EOT
            #!/usr/bin/env bash
            
            apt-get update
            apt-get -y install figlet jq make
            
            # Generate system banner
            figlet "${welcome_message}" > /etc/motd
            
            # Setup DNS Search domains
            echo 'search ${search_domains}' > '/etc/resolvconf/resolv.conf.d/base'
            resolvconf -u
            
            # Setup local vanity hostname
            echo '${hostname}' | sed 's/\.$//' > /etc/hostname
            hostname `cat /etc/hostname`
            
            ##
            ## Setup SSH Config
            ##
            cat <<"__EOF__" > /home/${ssh_user}/.ssh/config
            Host *
                StrictHostKeyChecking no
            __EOF__
            chmod 600 /home/${ssh_user}/.ssh/config
            chown ${ssh_user}:${ssh_user} /home/${ssh_user}/.ssh/config
            
            # Setup default `make` support
            echo 'alias make="make -C /usr/local/include --no-print-directory"' >> /etc/skel/.bash_aliases
            cp /etc/skel/.bash_aliases /root/.bash_aliases
            cp /etc/skel/.bash_aliases /home/${ssh_user}/.bash_aliases
            
            echo 'default:: help' > /usr/local/include/Makefile
            echo '-include Makefile.*' >> /usr/local/include/Makefile
            
            ##
            ## Makefile help
            ##
            cat <<"__EOF__" > /usr/local/include/Makefile.help
            
            # Ensures that a variable is defined
            define assert-set
              @[ -n "$($1)" ] || (echo "$(1) not defined in $(@)"; exit 1)
            endef
            
            default:: help
            
            .PHONY : help
            ## This help screen
            help:
            	@printf "Available targets:\n\n"
            	@awk '/^[a-zA-Z\-\_0-9%:\\]+:/ { \
            			helpMessage = match(lastLine, /^## (.*)/); \
            			if (helpMessage) { \
            					helpCommand = $$$1; \
            					helpMessage = substr(lastLine, RSTART + 3, RLENGTH); \
            						gsub("\\\\", "", helpCommand); \
            						gsub(":+$$$", "", helpCommand); \
            					printf "  \x1b[32;01m%-35s\x1b[0m %s\n", helpCommand, helpMessage; \
            			} \
            	} \
            	{ lastLine = $$$0 }' $(MAKEFILE_LIST) | sort -u
            	@printf "\n"
            
            __EOF__
            chmod 644 /usr/local/include/Makefile.help
            
            ${user_data}
        EOT
      + vars     = {
          + "hostname"        = "fishtech-bastion."
          + "search_domains"  = ""
          + "ssh_user"        = "ec2-user"
          + "user_data"       = ""
          + "welcome_message" = "prod"
        }
    }

  # module.bastion.module.bastion.aws_iam_instance_profile.default[0] will be created
  + resource "aws_iam_instance_profile" "default" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bastion-prod-fishtech-bastion"
      + path        = "/"
      + role        = "bastion-prod-fishtech-bastion"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.bastion.module.bastion.aws_iam_role.default[0] will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bastion-prod-fishtech-bastion"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bastion.module.bastion.aws_instance.default[0] will be created
  + resource "aws_instance" "default" {
      + ami                          = "ami-0947d2ba12ee1ff75"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + iam_instance_profile         = "bastion-prod-fishtech-bastion"
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "fishtech"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"      = "bastion-prod-fishtech-bastion"
          + "Namespace" = "bastion"
          + "Stage"     = "prod"
          + "app"       = "fishtech"
          + "env"       = "prod"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "b71b3a3d45cd666fcbfee544bcc5643244f68dd9"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = false
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = (known after apply)
        }
    }

  # module.bastion.module.bastion.aws_security_group.default[0] will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Bastion security group (only SSH inbound access is allowed)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "bastion-prod-fishtech-bastion"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "bastion-prod-fishtech-bastion"
          + "Namespace" = "bastion"
          + "Stage"     = "prod"
          + "app"       = "fishtech"
          + "env"       = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "fishtech-prod"
      + task_role_arn   = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.data.aws_iam_policy_document.task_execution_role_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "task_execution_role_policy_doc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.hello_world_service.module.ecs_service.aws_cloudwatch_log_group.main will be created
  + resource "aws_cloudwatch_log_group" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "/ecs/prod/fishtech"
      + retention_in_days = 90
      + tags              = {
          + "Automation"  = "Terraform"
          + "Environment" = "prod"
          + "Name"        = "fishtech-prod"
        }
    }

  # module.hello_world_service.module.ecs_service.aws_cloudwatch_metric_alarm.alarm_cpu[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "Monitors ECS CPU Utilization"
      + alarm_name                            = "fishtech-prod-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "fishtech-prod"
          + "ServiceName" = "fishtech"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 120
      + statistic                             = "Average"
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.hello_world_service.module.ecs_service.aws_cloudwatch_metric_alarm.alarm_mem[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_mem" {
      + actions_enabled                       = true
      + alarm_description                     = "Monitors ECS CPU Utilization"
      + alarm_name                            = "fishtech-prod-mem"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "fishtech-prod"
          + "ServiceName" = "fishtech"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 120
      + statistic                             = "Average"
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.hello_world_service.module.ecs_service.aws_ecs_service.main[0] will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fishtech"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "fishtech-prod"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "fishtech-prod"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.hello_world_service.module.ecs_service.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + entryPoint       = [
                      + "/bin/sh",
                      + "-c",
                      + "echo 'cGFja2FnZSBtYWluCgppbXBvcnQgKAoJImVuY29kaW5nL2pzb24iCgkiZm10IgoJImxvZyIKCSJuZXQvaHR0cCIKCSJvcyIKCSJzdHJjb252IgopCgp0eXBlIFJlcXVlc3RMb2cgc3RydWN0IHsKCVJlbW90ZUFkZHIgICAgc3RyaW5nICAgICAgICAgICAgICBganNvbjoicmVtb3RlX2FkZHIiYAoJTWV0aG9kICAgICAgICBzdHJpbmcgICAgICAgICAgICAgIGBqc29uOiJtZXRob2QiYAoJUmVxdWVzdFVSSSAgICBzdHJpbmcgICAgICAgICAgICAgIGBqc29uOiJyZXF1ZXN0X3VyaSJgCglIb3N0ICAgICAgICAgIHN0cmluZyAgICAgICAgICAgICAgYGpzb246Imhvc3QiYAoJQ29udGVudExlbmd0aCBpbnQ2NCAgICAgICAgICAgICAgIGBqc29uOiJjb250ZW50X2xlbmd0aCJgCglIZWFkZXIgICAgICAgIG1hcFtzdHJpbmddW11zdHJpbmcgYGpzb246ImhlYWRlciJgCglQcm90b2NvbCAgICAgIHN0cmluZyAgICAgICAgICAgICAgYGpzb246InByb3RvY29sImAKfQoKZnVuYyBtYWluKCkgewoJcG9ydDEsIGVyciA6PSBzdHJjb252LkF0b2kob3MuR2V0ZW52KCJQT1JUMSIpKQoJaWYgZXJyICE9IG5pbCB7CgkJcGFuaWMoZXJyKQoJfQoJcG9ydDIsIGVyciA6PSBzdHJjb252LkF0b2kob3MuR2V0ZW52KCJQT1JUMiIpKQoJaWYgZXJyICE9IG5pbCB7CgkJcGFuaWMoZXJyKQoJfQoKCWZpbmlzaCA6PSBtYWtlKGNoYW4gYm9vbCkKCglzZXJ2ZXIxIDo9IGh0dHAuTmV3U2VydmVNdXgoKQoJc2VydmVyMS5IYW5kbGVGdW5jKCIvIiwgaGVsbG9Xb3JsZCkKCXNlcnZlcjIgOj0gaHR0cC5OZXdTZXJ2ZU11eCgpCglzZXJ2ZXIyLkhhbmRsZUZ1bmMoIi8iLCBoZWxsb1dvcmxkKQoKCWdvIGZ1bmMoKSB7CgkJbG9nLkZhdGFsKGh0dHAuTGlzdGVuQW5kU2VydmUoZm10LlNwcmludGYoIjolZCIsIHBvcnQxKSwgc2VydmVyMSkpCgl9KCkKCglnbyBmdW5jKCkgewoJCWxvZy5GYXRhbChodHRwLkxpc3RlbkFuZFNlcnZlKGZtdC5TcHJpbnRmKCI6JWQiLCBwb3J0MiksIHNlcnZlcjIpKQoJfSgpCgoJPC1maW5pc2gKfQoKZnVuYyBoZWxsb1dvcmxkKHcgaHR0cC5SZXNwb25zZVdyaXRlciwgciAqaHR0cC5SZXF1ZXN0KSB7CglfLCBlcnIgOj0gdy5Xcml0ZShbXWJ5dGUoIkhlbGxvLCB3b3JsZCFcbiIpKQoJaWYgZXJyICE9IG5pbCB7CgkJbG9nLkZhdGFsKGVycikKCX0KCXJlcXVlc3RMb2cgOj0gUmVxdWVzdExvZ3sKCQlSZW1vdGVBZGRyOiAgICByLlJlbW90ZUFkZHIsCgkJTWV0aG9kOiAgICAgICAgci5NZXRob2QsCgkJUmVxdWVzdFVSSTogICAgci5SZXF1ZXN0VVJJLAoJCUhvc3Q6ICAgICAgICAgIHIuSG9zdCwKCQlDb250ZW50TGVuZ3RoOiByLkNvbnRlbnRMZW5ndGgsCgkJSGVhZGVyOiAgICAgICAgci5IZWFkZXIsCgkJUHJvdG9jb2w6ICAgICAgci5Qcm90bywKCX0KCWpzb25Mb2csIGVyciA6PSBqc29uLk1hcnNoYWwocmVxdWVzdExvZykKCWlmIGVyciAhPSBuaWwgewoJCWxvZy5GYXRhbChlcnIpCgl9Cglsb2cuUHJpbnRmKCIlc1xuIiwganNvbkxvZykKCn0K' | base64 -d > helloworld.go && go run helloworld.go",
                    ]
                  + environment      = [
                      + {
                          + name  = "PORT1"
                          + value = "8080"
                        },
                      + {
                          + name  = "PORT2"
                          + value = "8081"
                        },
                    ]
                  + essential        = true
                  + image            = "golang:alpine"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/prod/fishtech"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "helloworld"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = []
                  + name             = "fishtech-prod"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                      + {
                          + containerPort = 8081
                          + hostPort      = 8081
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "fishtech-prod"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.aws_iam_role.task_execution_role[0] will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role-fishtech-prod"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role-fishtech-prod"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.aws_iam_role_policy.task_execution_role_policy[0] will be created
  + resource "aws_iam_role_policy" "task_execution_role_policy" {
      + id     = (known after apply)
      + name   = "ecs-task-execution-role-fishtech-prod-policy"
      + policy = (known after apply)
      + role   = "ecs-task-execution-role-fishtech-prod"
    }

  # module.hello_world_service.module.ecs_service.aws_security_group.ecs_sg will be created
  + resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "fishtech-prod container security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-fishtech-prod"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Automation"  = "Terraform"
          + "Environment" = "prod"
          + "Name"        = "ecs-fishtech-prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.hello_world_service.module.ecs_service.aws_security_group_rule.app_ecs_allow_health_check_from_alb[0] will be created
  + resource "aws_security_group_rule" "app_ecs_allow_health_check_from_alb" {
      + description              = "Allow in health check from ALB"
      + from_port                = 8081
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8081
      + type                     = "ingress"
    }

  # module.hello_world_service.module.ecs_service.aws_security_group_rule.app_ecs_allow_https_from_alb[0] will be created
  + resource "aws_security_group_rule" "app_ecs_allow_https_from_alb" {
      + description              = "Allow in ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.hello_world_service.module.ecs_service.aws_security_group_rule.app_ecs_allow_outbound will be created
  + resource "aws_security_group_rule" "app_ecs_allow_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All outbound"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.network.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "fishtech"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-private-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-public-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-public-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "fishtech"
          + "app"  = "fishtech"
          + "env"  = "prod"
        }
    }

  # module.prowler.module.ecs-fargate-scheduled-task.data.aws_iam_policy_document.scheduled_task_event_role_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scheduled_task_event_role_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecs:RunTask",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowECSRunTask"
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "AllowIAMPassRole"
        }
    }

  # module.prowler.module.ecs-fargate-scheduled-task.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "scheduled-task-rule"
      + schedule_expression = "cron(0 12 * * ? *)"
      + tags                = {
          + "Name" = "scheduled-task-rule"
        }
    }

  # module.prowler.module.ecs-fargate-scheduled-task.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + role_arn  = (known after apply)
      + rule      = "scheduled-task-rule"
      + target_id = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "LATEST"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = true
              + subnets          = (known after apply)
            }
        }
    }

  # module.prowler.module.ecs-fargate-scheduled-task.aws_iam_role.scheduled_task_event_role will be created
  + resource "aws_iam_role" "scheduled_task_event_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scheduled-task-task-event-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.prowler.module.ecs-fargate-scheduled-task.aws_iam_role_policy.scheduled_task_event_role_policy will be created
  + resource "aws_iam_role_policy" "scheduled_task_event_role_policy" {
      + id     = (known after apply)
      + name   = "scheduled-task-task-event-role-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.prowler.module.ecs_task_definition.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command          = [
                      + "-M",
                      + "json",
                    ]
                  + environment      = [
                      + {
                          + name  = "app"
                          + value = "fishtech"
                        },
                      + {
                          + name  = "env"
                          + value = "prod"
                        },
                    ]
                  + essential        = true
                  + image            = "toniblyx/prowler:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/fishtech/prowler/prod"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "container"
                        }
                    }
                  + name             = "prowler"
                  + stopTimeout      = 120
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "prowler"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "Name" = "prowler"
        }
      + task_role_arn            = (known after apply)
    }

  # module.prowler.module.ecs_task_definition.aws_iam_role.execution[0] will be created
  + resource "aws_iam_role" "execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prowler-execution-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.prowler.module.ecs_task_definition.aws_iam_role.task[0] will be created
  + resource "aws_iam_role" "task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prowler-task-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.prowler.module.ecs_task_definition.aws_iam_role_policy.log_agent[0] will be created
  + resource "aws_iam_role_policy" "log_agent" {
      + id     = (known after apply)
      + name   = "prowler-log-permissions"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.prowler.module.ecs_task_definition.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "prowler-execution-role"
    }

Plan: 77 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/hello_world_service.ecs_service/main.tf line 2, in locals:
   2:   awslogs_group         = "${var.logs_cloudwatch_group == "" ? "/ecs/${var.environment}/${var.name}" : var.logs_cloudwatch_group}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @brentmitchell25, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Prod`*